{
  "title": "Attack on Titan: No Regrets",
  "url": "https://zoroto.com.in/anime/attack-on-titan-no-regrets/",
  "alternative_titles": "Shingeki no Kyojin: Kuinaki Sentaku",
  "description": "Many years before becoming the famed captain of the Survey Corps, a young Levi struggles to survive in the capital’s garbage dump, the Underground. As the boss of his own criminal operation, Levi attempts to get by with meager earnings while aided by fellow criminals, Isabel Magnolia and Farlan Church. With little hope for the future, Levi accepts a deal from the anti-expedition faction leader Nicholas Lobov, who promises the trio citizenship aboveground if they are able to successfully assassinate Erwin Smith, a squad leader of the Survey Corps. As Levi and Erwin cross paths, Erwin acknowledges Levi’s agility and skill and gives him the option to either become part of the expedition team, or be turned over to the Military Police, to atone for his crimes. Now closer to the man they are tasked to kill, the group plans to complete their mission and save themselves from a grim demise in the dim recesses of their past home. However, they are about to learn that the surface world is not as liberating as they had thought and that sometimes, freedom can come at a heavy price. Based on the popular spin-off manga of the same name, Shingeki no Kyojin: Kuinaki Sentaku illustrates the encounter between two of Shingeki no Kyojin’s pivotal characters, as well as the events of the 23rd expedition beyond the walls. [Written by MAL Rewrite]",
  "cover_image": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/0b1d36294038c6094016be2c5176dd79.jpg",
  "genres": [
    "Action",
    "Fantasy",
    "Shoujo"
  ],
  "status": "Completed",
  "type": "OVA",
  "studio": "Wit Studio",
  "duration": "27m",
  "season": null,
  "released": null,
  "producers": [
    "Kodansha",
    "Pony Canyon",
    "Production I.G",
    "Wit Studio"
  ],
  "rating": null,
  "total_episodes": 2,
  "available_episodes": 2,
  "episodes": [
    {
      "episode_number": "1",
      "episode_url": "https://zoroto.com.in/attack-on-titan-no-regrets-episode-1/",
      "episode_title": "1",
      "video_sources": [
        "https://gogoanime.com.by/streaming.php?id=attack-on-titan-no-regrets-168&ep=4208&server=hd-2&type=sub"
      ],
      "has_videos": true
    },
    {
      "episode_number": "2",
      "episode_url": "https://zoroto.com.in/attack-on-titan-no-regrets-episode-2/",
      "episode_title": "2",
      "video_sources": [
        "https://gogoanime.com.by/streaming.php?id=attack-on-titan-no-regrets-168&ep=4209&server=hd-2&type=sub"
      ],
      "has_videos": true
    }
  ],
  "scraped_at": "2026-01-30 12:04:46"
}